{
  "presidents": [
    {
      "no": "5",
      "name": "Murtala Muhammed",
      "imgsrc": "President-Murtala Muhammed.jpeg",
      "from": 1975,
      "to": 1976,
      "reason": "assasinated",
      "born": 1938,
      "party": "None (Military)",
      "diedInOffice": true,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "unclebigbay",
          "github_url": "https://github.com/unclebay143",
          "extra_url": "unclebigbay.com"
        }
      ],

      "moreinfo": "Murtala Ramat Muhammed (8 November 1938 – 13 February 1976) was a Nigerian general who led the Northern counter-coup forces in overthrowing the Republic of Nigeria and featured prominently during the Nigerian Civil War and thereafter ruled over Nigeria from 30 July 1975 until his assassination on 13 February 1976. This period in Nigerian history, from the Northern counter-coup victory to Murtala's death, is commonly associated with the institutionalization of the military in politics. Murtala Ramat Mohammed, initiated many changes during his brief time in office: he began the process of moving the federal capital to Abuja, addressed the issue of government inefficiency, and, most important, initiated the process for a return to civilian rule. Born in Kano, into a ruling-class religious family, Murtala served in the Nigerian Army as a cadet in the Royal Military Academy, Sandhurst. He later served in Congo; eventually rose through the ranks to become brigadier general in 1971, aged 33, becoming one of the youngest generals in Nigeria. Three years later Murtala became the Federal Commissioner for Communications in Lagos. As a conservative and federalist, Murtala regretted the overthrow of the First Republic and the promulgation of Aguiyi Ironsi's unification decree of 1966. He was devastated by the assassination of Sir Ahmadu Bello, and for a time seriously considered the secession of Northern Nigeria. His career redoubled after Chukwuma Kaduna Nzeogwu and the young majors orchestrated the first military coup in Nigeria of 1966 coup empowering him to lead the mutiny of the night of 29 July 1966 in Abeokuta. Murtala was briefly considered as Supreme Commander before the appointment of Yakubu Gowon. He also masterminded the July 1966 counter coup, which evidently, sparked the Nigerian Civil War. During the war, he commandeered Nigeria's second infantry division which was responsible for the death of civilians and much of the rebels. His command's use of veteran soldiers, no quarter, and scorched earth strategies led to between 10,000 and 30,000 deaths. Combined with the total wartime death toll of three million making the civil war one of the deadliest in modern history."
    },
    {
      "no": "7th and 15th",
      "name": "Muhammadu Buhari",
      "tribe": "Hausa Fulani",
      "imgsrc": "President-Muhammadu-Buhari-President.jpg",
      "from": 2015,
      "to": "tilldate",
      "reason": null,
      "born": 1942,
      "party": "APC",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "unclebigbay",
          "github_url": "https://github.com/unclebay143",
          "extra_url": "unclebigbay.com"
        }
      ],

      "moreinfo": "Muhammadu Buhari, Muhammadu also spelled Muhammad, (born December 17, 1942, Daura, Nigeria), Nigerian military leader and politician who served as Nigeria’s head of state in 1984–85 and was democratically elected president in 2015.Educated largely in Katsina, Buhari took military training in Kaduna as well as in Great Britain, India, and the United States. He was involved in the military coup that ousted Yakubu Gowon in 1975 and was appointed military governor of North Eastern state (now Borno) that same year. He was appointed federal commissioner for petroleum resources by Gen. Olusegun Obasanjo, who became military head of state when Gowon’s successor, Murtala Mohammed, was assassinated in 1976. By 1977 Buhari had become the military secretary at Supreme Military Headquarters, which was the seat of government. By September 1979 he had returned to regular army duties and commanded a division based in Kaduna. Although civilian government had returned to Nigeria in 1979 with the election of Shehu Shagari, dissatisfaction with dismal economic conditions and what the military perceived as corrupt politicians led to another military coup on December 31, 1983, and Buhari was chosen unanimously to be the new head of state."
    },
    {
      "no": "14",
      "name": "Dr. Goodluck Ebele Jonathan",
      "tribe": "Igbo",
      "imgsrc": "President-Goodluck-Ebele-Jonathan.png",
      "from": 2011,
      "to": 2015,
      "reason": "transferred power",
      "born": 1957,
      "party": "PDP",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "unclebigbay",
          "github_url": "https://github.com/unclebay143",
          "extra_url": "unclebigbay.com"
        }
      ],

      "moreinfo": "His Excellency Dr Goodluck Ebele Jonathan President Federal Republic of Nigeria 2010-2015 was born in Otuoke Bayelsa State on November 20, 1957 He holds Bachelors Masters and Doctorate degrees in Zoology Hydrobiology and Fisheries Biology respectively; all obtained from the University of Port Harcourt, Rivers State, Nigeria. Before joining politics, Dr Jonathan served as a Science Inspector of Education, a lecturer, and later as an Assistant Director of the Directorate of Environmental Protection and Pollution Control in the defunct Oil Mineral Producing Areas Development Commission (now Niger Delta Development Commission)."
    },
    {
      "no": "13",
      "name": "Alhaji Umaru Musa Yar'Adua",
      "tribe": "Hausa",
      "imgsrc": "President-Alhaji-Umaru-Musa-Yar'Adua.jpg",
      "from": 2007,
      "to": 2010,
      "reason": "died",
      "born": 1951,
      "party": "PDP",
      "diedInOffice": true,
      "dateofdeath": 2010,
      "causeofdeath": "Sickness",
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "unclebigbay",
          "github_url": "https://github.com/unclebay143",
          "extra_url": "unclebigbay.com"
        }
      ],

      "moreinfo": "Born on 16 August 1951 and died in power on 5 May 2010. He was the 13th president of the Federal Republic of Nigeria. He served has a governor of Katsina State in northern Nigeria from 29 May 1999 to 28 May 2007. He was declared the winner of the 21 April 2007 Presidential Election and was sworn into office on 29th May 2007. He started his education at Rafukka Primary School in 1958, and moved to Dutsinma Boarding Primary School in 1962. He attended the Government College at Keffi from 1965 until 1969."
    },
    {
      "no": "12",
      "name": "Chief Olusegun Obasanjo",
      "tribe": "Yoruba",
      "imgsrc": "President-Chief-Olusegun-Obasanjo.jpg",
      "from": 1999,
      "to": 2007,
      "reason": "transferred power",
      "born": 1937,
      "party": "APC",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "unclebigbay",
          "github_url": "https://github.com/unclebay143",
          "extra_url": "unclebigbay.com"
        },
        {
          "name": "tylerjusfly",
          "github_url": "https://github.com/tylerjusfly"
        }
      ],

      "moreinfo": "Olusegun Obasanjo, (born March 5, 1937, Abeokuta, Nigeria), Nigerian general, statesman, and diplomat, who was the first military ruler in Africa to hand over power to a civilian government. He served as Nigeria’s military ruler (1976–79) and, as a civilian, as president (1999–2007). Obasanjo attended Baptist Boys’ High School in Abeokuta, in southwest Nigeria, and later worked as a teacher. Unable to afford college, he joined the army in 1958 and received officer training in England. Obasanjo rose quickly through the army ranks. During the Biafra conflict (1967–70) he was appointed to head a commando division that was stationed at the Biafran front in southeastern Nigeria. The conflict ended when Biafran forces surrendered to him in January 1970."
    },
    {
      "no": "11",
      "name": "General Abdulsalami Abubakar",
      "tribe": "Hausa",
      "imgsrc": "President-General-Abdulsalami-Abubakar.jpg",
      "from": 1998,
      "to": 1999,
      "reason": "resigned",
      "born": 1942,
      "party": "PRC",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "unclebigbay",
          "github_url": "https://github.com/unclebay143",
          "extra_url": "unclebigbay.com"
        }
      ],

      "moreinfo": "Abdusalam Abubakar, Abdusalam also spelled Abdusalami or Abdulsalam, (born June 13, 1942, Minna, Nigeria), Nigerian military leader, Hailing from the middle belt of the country, he served as head of state (1998–99), During his leadership, Nigeria adopted a modified version of the 1979 constitution, which provided for multiparty elections. Abubakar joined the army in 1975 and received his formal military training in the United States. He commanded Nigeria’s contingent of United Nations peacekeeping troops in Lebanon in 1981. By the late 1980s he was a senior officer and in 1993 was named defense chief of staff by General Sani Abacha, who became Nigeria’s military ruler in that year. He is the currently the chairman of the national peace committee."
    },
    {
      "no": "10",
      "name": "General Sani Abacha",
      "tribe": "Hausa",
      "imgsrc": "President-Sani-Abacha.jpg",
      "from": 1993,
      "to": 1998,
      "reason": "died",
      "born": 1943,
      "party": "None (Military)",
      "diedInOffice": true,
      "extra_information": [
        {
          "bio": "Sani Abacha, was a Nigerian militarty leader, who served as head of state (1993 - 1998). Abacha received his formal military training at the Nigerian and British military training colleges. He r0ose through the ranks in the Nigerian military and by 1983 had achieved the rank of brigadier when he assisted Ibrahim Babangida in overthrowing Shehu Shagari, who had been elected to his second presidential term in 1983."
        }
      ],
      "contributors": [
        {
          "name": "Eunit",
          "github_url": "https://github.com/eunit99",
          "extra_url": "https://eunit99.github.io/"
        }
      ],

      "moreinfo": "Sani Abacha GCFR (About this soundpronunciation (20 September 1943 – 8 June 1998) was a Nigerian military general who served as the military head of state of Nigeria from 1993 until his death in 1998. He was also Chief of Army Staff between 1985 to 1990; Chief of Defence Staff between 1990 to 1993; and Minister of Defence. In 1993, Abacha became the first Nigerian Army officer to attain the rank of a full military general without skipping a single rank. His rule saw the achievement of several economic feats and also recorded human rights abuses and several political assassinations. He has been dubbed a kleptocrat and a dictator by several commentators. Abacha was born and brought up in Kano. He attended the Nigerian Military Training College in Kaduna, and was commissioned in 1963 after he had attended the Mons Officer Cadet School in Aldershot, England. The military career of Abacha was marked by involvement in all the military coups in Nigeria. When he was still a second lieutenant with the 3rd Battalion in Kaduna, he took part in the July 1966 Nigerian counter-coup from the conceptual stage. He could well have been a participant in the Lagos or Abeokuta phases of the coup the previous January as well. In addition, Abacha played a prominent role in the 1983 Nigerian coup d'état which brought General Muhammadu Buhari to power; and the 1985 Nigerian coup d'etat which removed Buhari and brought General Ibrahim Babangida to power. When General Ibrahim Babangida was named President and Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria in 1985, Abacha was named Chief of Army Staff. He was later appointed Minister of Defence in 1990"
    },
    {
      "no": "8",
      "name": "General Ibrahim Babangida",
      "tribe": "Gwari",
      "imgsrc": "President-General-Ibrahim-Babangida.jpg",
      "from": 1985,
      "to": 1993,
      "reason": "resigned",
      "born": 1941,
      "party": "PDP",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": "Ibrahim Babangida was born on 17 August 1941 in Minna to his father, Muhammad Babangida and mother Aisha Babangida. He received early Islamic education before attending primary school from 1950 to 1956."
        }
      ],
      "contributors": [
        {
          "name": "LayoBright",
          "github_url": "https://github.com/Ayodejioladimeji",
          "extra_url": "https://oladimejiayodeji.netlify.app"
        }
      ],

      "moreinfo": "Ibrahim Babangida, (born August 17, 1941, Minna, Nigeria), Nigerian military leader who served as head of state (1985–93).  Born in northern Niger state, Babangida received military training in Nigeria, India, Great Britain, and the United States. He rose through the ranks and was known for his courage—he played a major role in suppressing an attempted coup in 1976 when he walked into a rebel-held radio station unarmed. After Murtala Mohammed became the military head of state in 1975, Babangida joined his Supreme Military Council. He played a significant role in the coup that replaced the civilian government of Shehu Shagari with the military regime led by Muhammad Buhari. However, deep dissatisfaction with Buhari’s restrictive governance led Babangida to oust Buhari in August 1985. Babangida lessened the governmental control of the press and released a number of detainees from the former civilian government. However, he faced the same economic problems that Buhari had struggled with and the same domestic dissatisfaction. He came to an agreement with the International Monetary Fund and received new loans from the World Bank, but the resultant devaluation of the naira, the local currency, led to social unrest, which he addressed by dissolving part of the Nigeria Labour Congress and temporarily closing the universities. Babangida announced early in 1986 that a civilian government would be formed by 1990, later extending the date by two years to allow more time for preparation. He decreed that no politicians from the civilian regimes or office-holding military officials could stand as candidates. He allowed no political parties during the transition period and approved only two political parties when campaigning began. Expressing dissatisfaction with the process of fielding new political parties, the Babangida government created its own parties, the National Republican Convention and the Social Democratic Party (SDP). As a further move to show that he was firmly in control, Babangida dissolved the Armed Forces Ruling Council in favour of smaller bodies and dismissed many of his closest military colleagues. An attempted coup in April 1990 led by Major Gideon Orkar, who represented various northern Muslim states in their attempt to secede from what they perceived to be a corrupt and—most important—non-Islamic country, was quickly contained. Babangida later announced that Nigeria had suspended its membership in the Islamic Conference Organization amid speculation among southern Nigerians that he was trying to make the country Islamic. The long-planned transfer of the federal capital from Lagos to Abuja, a location in central Nigeria, was completed under Babangida in 1991."
    },

    {
      "no": "7",
      "name": "Major General Muhammadu Buhari",
      "tribe": "Hausa",
      "imgsrc": "Muhammadu-Buhari-President.jpg",
      "from": 1983,
      "to": 1985,
      "reason": "deposed",
      "born": 1942,
      "party": "APC",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": "Muhammadu Buhari GCFR is a Nigerian politician who has been president of Nigeria since 2015. Buhari is a retired Nigerian Army Major General and has served as military head of state in Nigeria between 1983 to 1985, after taking power in a military coup d'état."
        }
      ],
      "contributors": [
        {
          "name": "Anushka",
          "github_url": "https://github.com/Anushh23",
          "extra_url": null
        }
      ],

      "moreinfo": "Muhammadu Buhari, Muhammadu also spelled Muhammad, (born December 17, 1942, Daura, Nigeria), Nigerian military leader and politician who served as Nigeria’s head of state in 1984–85 and was democratically elected president in 2015.Educated largely in Katsina, Buhari took military training in Kaduna as well as in Great Britain, India, and the United States. He was involved in the military coup that ousted Yakubu Gowon in 1975 and was appointed military governor of North Eastern state (now Borno) that same year. He was appointed federal commissioner for petroleum resources by Gen. Olusegun Obasanjo, who became military head of state when Gowon’s successor, Murtala Mohammed, was assassinated in 1976. By 1977 Buhari had become the military secretary at Supreme Military Headquarters, which was the seat of government. By September 1979 he had returned to regular army duties and commanded a division based in Kaduna. Although civilian government had returned to Nigeria in 1979 with the election of Shehu Shagari, dissatisfaction with dismal economic conditions and what the military perceived as corrupt politicians led to another military coup on December 31, 1983, and Buhari was chosen unanimously to be the new head of state. Many of the economic problems that had existed under the Shagari administration also plagued the Buhari regime, and Buhari instituted austerity measures. He took a tough stance on corruption: during his tenure, hundreds of politicians and business officials were tried and convicted or awaited trial on corruption-related charges. His regime launched the “War Against Indiscipline,” a program which sought to promote positive values in Nigerian society, although authoritarian methods were sometimes used in the program’s implementation. In an effort to stop dissent against his policies, Buhari instituted restrictions on the press, political freedoms, and trade unionists. Although many Nigerian citizens had initially welcomed Buhari’s efforts to root out corruption and improve societal values, the repressive measures employed by his regime, against a backdrop of continuing economic troubles, led to discontent. By August 1985 even the military had had enough, and on August 27 Maj. Gen. Ibrahim Babangida took control of the government. Buhari was detained in Benin City but was released at the end of 1988."
    },
    {
      "no": "6",
      "name": "Shehu Usman Aliyu Shagari",
      "tribe": "Fulani",
      "imgsrc": "President-Shehu-Shagari.jpg",
      "from": 1979,
      "to": 1983,
      "reason": "overthrown",
      "born": 1942,
      "party": "NPN",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "poly4concept",
          "github_url": "https://github.com/poly4concept",
          "extra_url": "http://alhazanmubarak.me/my-portfolio/"
        }
      ],

      "moreinfo": "Shehu Shagari, in full Alhaji Shehu Usman Aliyu Shagari, (born 1925, Shagari, Nigeria—died December 28, 2018, Abuja, Nigeria), Nigerian politician, president of Nigeria from 1979 to 1983. Shagari’s great-grandfather founded the village from which the family took its name. Shagari was educated at Kaduna College and taught school briefly. As one of the few northerners to show an interest in national politics, he ran for office in 1954 and was elected to the federal House of Representatives. Thereafter he held several posts and was a member of every administration after Nigeria’s independence in 1960. After a military coup in 1966 ended civilian government, he retired to his hometown. Gen. Yakubu Gowon appointed him federal commissioner for economic development in 1971, a position he took over from Chief Obafemi Awolowo. He faced Awolowo in 1979 and narrowly defeated him in presidential elections after the military government led by Olusegun Obasanjo allowed a return to civilian rule. Nigeria was badly shaken by the international economic crisis of the early 1980s. Shagari took several steps to try to strengthen the economy—cutting the budget, calling in the International Monetary Fund, and expelling two million aliens (mostly Ghanaians) in 1983. He won the bitterly contested presidential elections in 1983, but the state of the economy and corruption in his administration worsened, and on December 31, 1983, a military coup led by Maj. Gen. Muhammad Buhari toppled the government, and Shagari was arrested. Shagari was cleared of personal corruption charges and released from detention in 1986 but was banned from participation in Nigerian politics for life."
    },
    {
      "no": "2",
      "name": "Chief Nnamdi Azikwe",
      "tribe": "Igbo",
      "imgsrc": "President-Nnamdi-Azikwe.jpg",
      "from": 1963,
      "to": 1966,
      "reason": null,
      "born": 1904,
      "party": "NCNCN",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "Adeyemi",
          "github_url": "https://github.com/buhari44",
          "extra_url": "https://afrikatechboyportfolio.netlify.app/"
        }
      ],

      "moreinfo": "Nnamdi Azikiwe, (born November 16, 1904, Zungeru, Nigeria—died May 11, 1996, Enugu), first president of independent Nigeria (1963–66) and prominent nationalist figure. Azikiwe attended various primary and secondary mission schools in Onitsha, Calabar, and Lagos. He arrived in the United States in 1925, where he attended several schools. Azikiwe earned multiple certificates and degrees, including bachelor’s and master’s degrees from Lincoln University in Pennsylvania and a second master’s degree from the University of Pennsylvania. In 1934 he went to the Gold Coast (now Ghana), where he founded a nationalist newspaper and was a mentor to Kwame Nkrumah (later the first president of Ghana) before returning to Nigeria in 1937. There he founded and edited newspapers and also became directly involved in politics, first with the Nigerian Youth Movement and later (1944) as a founder of the National Council of Nigeria and the Cameroons (NCNC), which became increasingly identified with the Igbo people of southern Nigeria after 1951. In 1948, with the backing of the NCNC, Azikiwe was elected to the Nigerian Legislative Council, and he later served as premier of the Eastern region (1954–59)."
    },
    {
      "no": "9",
      "name": "Ernest Shonekan",
      "tribe": "Igbo",
      "imgsrc": "Ernest_Shonekan.jpg",
      "from": 1993,
      "to": 1993,
      "reason": "overthrown",
      "born": 1936,
      "party": "Independent",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "Nazmi Feeroz",
          "github_url": "https://github.com/nazmifeeroz"
        }
      ],

      "moreinfo": "Chief Ernest Adegunle Oladeinde Shonekan GCFR (born 9 May 1936), titled Abese of Egbaland from 1981 (in addition to a variety of other chieftaincy titles),[1] is a Nigerian lawyer and statesman who served as the interim Head of State of Nigeria from 26 August 1993 to 17 November 1993."
    },
    {
      "no": "3",
      "name": "Major General Aguiyi Ironsi",
      "tribe": "Igbo",
      "imgsrc": "Major-General Johnson-Aguiyi-Ironsi.jpg",
      "from": 1966,
      "to": 1966,
      "reason": "overthrown",
      "born": 1924,
      "party": "None (Military)",
      "diedInOffice": true,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "Kehinde Onifade",
          "github_url": "https://github.com/kendoriddy"
        }
      ],

      "moreinfo": "Major General Johnson Thomas Umunnakwe Aguiyi Ironsi was the first Military Head of State in Nigeria. He seized power amidst the ensuing chaos following the 15 January 1966 military coup, which decapitated the country's leadership. He ruled from 16 January 1966 until his assassination on 29 July 1966 by a group of Northern army officers in a revolt against his government in what was popularly called the July Counter Coup. In 1942, Aguiyi-Ironsi joined the Nigerian Regiment, as a private with the seventh battalion.[8] He was promoted in 1946 to company sergeant major. Also in 1946, Aguiyi-Ironsi was sent on an officer training course in Staff College, Camberley, England. On 12 June 1949, after completion of his course at Camberley, he received a short-service commission as a second lieutenant in the Royal West African Frontier Force,[9] with a subsequent retroactive promotion to lieutenant effective from the same date."
    },
    {
      "no": "4",
      "name": "General Yakubu Gowon",
      "tribe": "Hausa",
      "imgsrc": "General-Yakubu-Gowon.jpg",
      "from": 1966,
      "to": 1975,
      "reason": "overthrown",
      "born": 1934,
      "party": "None (Military)",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "Kehinde Onifade",
          "github_url": "https://github.com/kendoriddy"
        }
      ],

      "moreinfo": "As Head of State, Gowon presided over the controversial Nigerian Civil War"
    },
    {
      "no": "5",
      "name": "Chief Olusegun Obasanjo",
      "tribe": "Yoruba",
      "imgsrc": "President-Chief-Olusegun-Obasanjo.jpg",
      "from": 1976,
      "to": 1979,
      "reason": "transferred power",
      "born": 1937,
      "party": "None (Military)",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "Emmanuel Tanimowo",
          "github_url": "https://github.com/Mannuel25",
          "extra_url": null
        }
      ],

      "moreinfo": "Olusegun Obasanjo, (born March 5, 1937, Abeokuta, Nigeria), Nigerian general, statesman, and diplomat, who was the first military ruler in Africa to hand over power to a civilian government. He served as Nigeria’s military ruler (1976–79) and, as a civilian, as president (1999–2007). Obasanjo attended Baptist Boys’ High School in Abeokuta, in southwest Nigeria, and later worked as a teacher. Unable to afford college, he joined the army in 1958 and received officer training in England. Obasanjo rose quickly through the army ranks. During the Biafra conflict (1967–70) he was appointed to head a commando division that was stationed at the Biafran front in southeastern Nigeria. The conflict ended when Biafran forces surrendered to him in January 1970."
    },
    {
      "no": "17",
      "name": "Abubakar Tafawa Balewa",
      "tribe": "Hausa",
      "imgsrc": "President-Abubakar-Tafawa-Balewa.jpg",
      "from": 1960,
      "to": 1963,
      "reason": null,
      "born": 1912,
      "party": "NPC",
      "diedInOffice": false,
      "extra_information": [
        {
          "bio": null
        }
      ],
      "contributors": [
        {
          "name": "Afolabi Mariam",
          "github_url": "https://github.com/mariamopeyemi",
          "extra_url": null
        }
      ],

      "moreinfo": "Abubakar Tafawa Balewa was conceived in December 1912 in Bauchi State, Nigeria. Balewa is the only one in Nigerian history to have been bestowed with the title of federal Prime Minister. Balewa ventured into the Nigerian government in 1952 as Minister of Works, and later as Minister of Transport. In 1957, he was elected Chief Minister, forming an alliance government between the NPC and the National council for Nigeria, and the Cameroons. He assumed an important job in the transitional period among colonial and indigenous rule of Nigeria. His legacy was made through the collaboration between ethnic groups and mediation of other African conflicts. Following quite a while of colonial rule, the British Crown finally gave up authority to Nigeria. Sir Abubakar Tafawa with Queen Elizabeth II at that point ruled Nigeria as the first prime minister from 1960-1963. This was when Nigeria turned into a Republic."
    }

  ]
}
